# Assignments: Prepping for Modeling

## 1. Create a Single Table

Hi there,

We just finished collecting our Q2 book sales data. Can you help us create one giant table that includes:

* April, May and June’s book sales
* Customer data

Each table has a field called customer_id that links all the tables together.

I’ve attached four files.

Thanks!\
Brooke

In [1]:
# Read all four files into a Jupyter Notebook
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
sns.set_style('darkgrid')

In [3]:
# Concatenate the April, May and June book sales DataFrames
April = pd.read_excel("../Data/Book_Sales_April.xlsx")
May = pd.read_excel("../Data/Book_Sales_May.xlsx")
June = pd.read_excel("../Data/Book_Sales_June.xlsx")
Customers = pd.read_csv("../Data/Book_Customers.csv")
df_list = ['April', 'May', 'June', 'Customers']
for df in df_list:
    print(eval(df).head(5) , end = '\n\n'+ '*'*25 + '\n\n')

   Purchase ID  Customer ID                Book  Audience        Genre  Price  \
0          401          101   Unicorns Are Cool  Children      Fiction   4.99
1          402          101     I Love Unicorns  Children      Fiction   5.99
2          403          102   All About Turtles     Teens  Non-Fiction  19.99
3          404          102    All About Whales     Teens  Non-Fiction  19.99
4          405          102  All About Dolphins     Teens  Non-Fiction  19.99

   Book Rating Purchase Location Purchase Date
0          3.6            Online    2023-04-01
1          4.1            Online    2023-04-01
2          3.3         In Person    2023-04-02
3          2.5         In Person    2023-04-02
4          4.2         In Person    2023-04-02

*************************

   Purchase ID  Customer ID                Book  Audience        Genre  Price  \
0          414          109    The Concert Hall    Adults      Fiction  22.72
1          415          110      Space and Time    Adults      Fiction  21.58
2          416          101            Rainbows  Children      Fiction  10.25
3          417          104  The Speed of Light    Adults      Fiction  20.32
4          418          106      Real Dinosaurs  Children  Non-Fiction   9.99

   Book Rating Purchase Location Purchase Date
0          4.7            Online    2023-05-01
1          3.7         In Person    2023-05-04
2          4.7            Online    2023-05-04
3          4.1         In Person    2023-05-04
4          3.4         In Person    2023-05-04

*************************

   Purchase ID  Customer ID                          Book  Audience  \
0          432          117                   Blue Waters    Adults
1          433          118                      The Cave    Adults
2          434          106       Best Dinosaur Book Ever  Children
3          435          103  Peter Penn: The Untold Story    Adults
4          436          101         Everything is Amazing  Children

         Genre  Price  Book Rating Purchase Location Purchase Date
0      Fiction  23.98          2.6            Online    2023-06-05
1      Fiction  24.99          4.7            Online    2023-06-07
2  Non-Fiction  10.49          4.7         In Person    2023-06-08
3  Non-Fiction  27.90          4.8         In Person    2023-06-08
4      Fiction   4.99          3.9         In Person    2023-06-08

*************************

   Customer ID Customer Name  Age Has School Aged Children Has_Pets
0          101     Alexander   36                      Yes       No
1          102         Mason   16                       No       No
2          103         Ethan   55                       No       No
3          104        Daniel   70                       No       No
4          105       Michael   18                       No      Yes

*************************

In [4]:
April.head(1)

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date
0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01

In [5]:
May.head(1)

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date
0,414,109,The Concert Hall,Adults,Fiction,22.72,4.7,Online,2023-05-01

In [6]:
June.head(1)

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date
0,432,117,Blue Waters,Adults,Fiction,23.98,2.6,Online,2023-06-05

In [7]:
April.columns.all() == May.columns.all() == June.columns.all()

True

In [8]:
April.columns.any() == May.columns.any() == June.columns.any()

True

In [9]:
Sales = pd.concat([April,May,June]).reset_index()
Sales.shape

(50, 10)

In [10]:
Sales.head(0)

Empty DataFrame
Columns: [index, Purchase ID, Customer ID, Book, Audience, Genre, Price, Book Rating, Purchase Location, Purchase Date]
Index: []

In [11]:
Customers.head(0)

Empty DataFrame
Columns: [Customer ID, Customer Name, Age, Has School Aged Children, Has_Pets]
Index: []

In [12]:
# Join the newly created book sales DataFrame with the customers DataFrame on customer_id
# Which type of join do you think would work best here?

In [13]:
Customers.shape

(28, 5)

In [14]:
how_list = ['left' , 'right', 'inner' , 'outer']
for i in how_list:
    i_shape = (Sales.
               merge(Customers , on = 'Customer ID' , how = i).
               shape)
    print(f"merging shape on {i} has {i_shape}")

merging shape on left has (50, 14)
merging shape on right has (53, 14)
merging shape on inner has (50, 14)
merging shape on outer has (53, 14)

In [15]:
left_merged = Sales.merge(Customers , on = 'Customer ID' , how = 'left')
left_merged[left_merged.isna().any(axis = 1)]

Empty DataFrame
Columns: [index, Purchase ID, Customer ID, Book, Audience, Genre, Price, Book Rating, Purchase Location, Purchase Date, Customer Name, Age, Has School Aged Children, Has_Pets]
Index: []

In [16]:
right_merged = Sales.merge(Customers , on = 'Customer ID' , how = 'right').head()
right_merged[right_merged.isna().any(axis = 1)]

Empty DataFrame
Columns: [index, Purchase ID, Customer ID, Book, Audience, Genre, Price, Book Rating, Purchase Location, Purchase Date, Customer Name, Age, Has School Aged Children, Has_Pets]
Index: []

In [17]:
inner_merged = Sales.merge(Customers , on = 'Customer ID' , how = 'inner').head()
inner_merged[inner_merged.isna().any(axis = 1)]

Empty DataFrame
Columns: [index, Purchase ID, Customer ID, Book, Audience, Genre, Price, Book Rating, Purchase Location, Purchase Date, Customer Name, Age, Has School Aged Children, Has_Pets]
Index: []

In [18]:
outer_merged = Sales.merge(Customers , on = 'Customer ID' , how = 'outer').head()
outer_merged[outer_merged.isna().any(axis = 1)]

Empty DataFrame
Columns: [index, Purchase ID, Customer ID, Book, Audience, Genre, Price, Book Rating, Purchase Location, Purchase Date, Customer Name, Age, Has School Aged Children, Has_Pets]
Index: []

In [19]:
left_merged.head()

,index,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,2,403,102,All About Turtles,Teens,Non-Fiction,19.99,3.3,In Person,2023-04-02,Mason,16,No,No
3,3,404,102,All About Whales,Teens,Non-Fiction,19.99,2.5,In Person,2023-04-02,Mason,16,No,No
4,4,405,102,All About Dolphins,Teens,Non-Fiction,19.99,4.2,In Person,2023-04-02,Mason,16,No,No

In [20]:
right_merged.head()

,index,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,0.0,401.0,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,1.0,402.0,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,8.0,409.0,101,Glitter Everything,Children,Fiction,7.49,2.7,Online,2023-04-15,Alexander,36,Yes,No
3,2.0,416.0,101,Rainbows,Children,Fiction,10.25,4.7,Online,2023-05-04,Alexander,36,Yes,No
4,14.0,428.0,101,Unicorns Are The Best,Children,Fiction,4.99,2.3,Online,2023-05-23,Alexander,36,Yes,No

In [21]:
inner_merged.head()

,index,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,8,409,101,Glitter Everything,Children,Fiction,7.49,2.7,Online,2023-04-15,Alexander,36,Yes,No
3,2,416,101,Rainbows,Children,Fiction,10.25,4.7,Online,2023-05-04,Alexander,36,Yes,No
4,14,428,101,Unicorns Are The Best,Children,Fiction,4.99,2.3,Online,2023-05-23,Alexander,36,Yes,No

In [22]:
outer_merged.head()

,index,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,0.0,401.0,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,1.0,402.0,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,8.0,409.0,101,Glitter Everything,Children,Fiction,7.49,2.7,Online,2023-04-15,Alexander,36,Yes,No
3,2.0,416.0,101,Rainbows,Children,Fiction,10.25,4.7,Online,2023-05-04,Alexander,36,Yes,No
4,14.0,428.0,101,Unicorns Are The Best,Children,Fiction,4.99,2.3,Online,2023-05-23,Alexander,36,Yes,No

## 2. Prepare Rows for Modeling

Hi again,

We are trying to predict which customers will purchase a book this month.

Can you reformat the data you compiled earlier this week so that it’s ready to be input into a model, with each row representing a customer instead of a purchase?

Thanks!\
Brooke

In [23]:
# What should one row of data look like for the model?

In [24]:
# Create a column called 'June Purchases' that sums up all purchases in June
june_purchases = (
    June.groupby('Customer ID')['Book']
    .count()
    .rename('June Purchase')
    .to_frame()
    .reset_index()
)
june_purchases.head(0)

Empty DataFrame
Columns: [Customer ID, June Purchase]
Index: []

In [25]:
# Create a column called 'Total Spend' that sums up the prices of all the books that were purchased in April and May
total_spend = (
    pd.concat([April,May])
    .groupby('Customer ID')['Price']
    .sum()
    .rename('Total Spend')
    .to_frame()
    .reset_index()
)
total_spend.head(0)

Empty DataFrame
Columns: [Customer ID, Total Spend]
Index: []

In [26]:
# Combine the 'June Purchases' and 'Total Spend' columns into a single DataFrame for modeling
modeling_df = total_spend.merge(june_purchases, on = 'Customer ID', how = 'left')
modeling_df.fillna(0)

    Customer ID  Total Spend  June Purchase
0           101        33.71            2.0
1           102        79.96            0.0
2           103        55.20            1.0
3           104        42.32            0.0
4           105        21.50            0.0
5           106        38.96            1.0
6           107        25.99            0.0
7           108         9.20            1.0
8           109        22.72            0.0
9           110        21.58            0.0
10          111        40.50            2.0
11          112        35.50            0.0
12          113        28.99            0.0
13          114        28.50            0.0
14          115        27.60            0.0
15          116        24.99            0.0

## 3. Prepare Columns for Modeling

Hi again,

Thanks for your help earlier this week! We just learned that we also have to make all of the data numeric before inputting it into a predictive model.

Can you turn the Audience text field into a numeric field?

Thanks!\
Brooke

In [38]:
# Change the Audience field into a dummy variable
June.columns.all() == April.columns.all() == May.columns.all()

True

In [48]:
Sales.drop(columns=['level_0','index'],inplace=True)

In [51]:
Sales.columns

Index(['Purchase ID', 'Customer ID', 'Book', 'Audience', 'Genre', 'Price',
       'Book Rating', 'Purchase Location', 'Purchase Date'],
      dtype='object')

In [59]:
audience_dummies = pd.get_dummies(Sales['Audience'] , dtype = int)
audience_dummies.head()

   Adults  Children  Teens
0       0         1      0
1       0         1      0
2       0         0      1
3       0         0      1
4       0         0      1

In [62]:
df_April_May = pd.concat([April,May])
df_April_May['Customer ID'].head()

0    101
1    101
2    102
3    102
4    102
Name: Customer ID, dtype: int64

In [67]:
pd.concat([df_April_May['Customer ID'],audience_dummies], axis = 1)

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

In [28]:
# Using the Audience dummy variables, create three new columns that contain
# the number of Adult / Children / Teen books purchased by each customer

In [29]:
# Combine the three new columns back with the customer-level data

## 4. Feature Engineering

Hi again,

I have one final request for you.

As a reminder, our goal is to try and predict which customer will purchase a book this month.

Can you create new features that you think will do a good job making a prediction?

Thanks!\
Brooke

In [68]:
modeling_df.head()

   Customer ID  Total Spend  June Purchase
0          101        33.71            2.0
1          102        79.96            NaN
2          103        55.20            1.0
3          104        42.32            NaN
4          105        21.50            NaN

In [30]:
# what features could do a good job predicting june purchases?

In [31]:
# create the feature

In [32]:
# add it to the dataframe for modeling

In [33]:
# create another feature

In [34]:
# add it to the dataframe for modeling

In [35]:
# view the final dataframe that is ready to be input into a model